# การใช้เครื่องหมายร่วมกับฟังก์ชั่น
# ในการสร้างโฟรซีเจอร์หรือฟังก์ชันในโมดูล จะมีการกำกับด้วยเครื่องหมาย () หลังชื่อโพรซีเจอร์ หรือ ฟังก์ชั่นที่สร้างขึ้นมา
# โดยจะถูกนำไปใช้สำหรับการผ่านค่าอาร์กิวเมนต์ ( Argument ) ของโพรซีเจอร์ หรือ ฟังก์ชัน

# แสดงการสร้างโพรซีเจอร์หรือฟังก์ชั่นโดยไม่มีตัวแปรอาร์กิวเมนต์
def showtime(): # การสร้างฟังก์ชั่น showtime ต้องมีเครื่องหมาย () เสมอ
    a = 100
    b = a + 10
    print(b)
showtime() # ใช้งาน function

# แสดงการสร้างโพรซีเจอร์หรือฟังก์ชันพร้อมกับตัวแปรอาร์กิวเมนต์