#การเข้าถึงตำแหน่งข้อมูลของชนิดช้อมูลลิสต์ เราสามารถเข้าถึงข้อมูลชนิดลิสต์ได้สองทางคือ จากทางด้านขวาและด้านซ้าย ด้วยการระบุ Index
#หากเข้าถึงข้อมูลจากด้านซ้ายจะเริ่มนับตำแหน่ง Index ที่ 0 ถ้าเข้าถึงตำแหน่งข้อมูลจากทางด้านขวางสุดจะเริ่ม Index ที่ -1
# -1
# รูปแบบ var[start: stop: step]
# โดยที่ start คือ จุดเริ่มต้น
#     stop คือ จุดสุดท้าย
#     step คือ การกระโดดข้าม
# ตำแหน่งด้านท้าย       -8     -7  -6  -5  -4  -3    -2   -1
#   book_list = Python Java  C  C++  C# Scala PHP .NET
# ตำแหน่งด้านหน้า       0      1    2   3   4   5     6    7

books_lst = ["Python", "Java", "C", "C++", "C#", "Scala", "PHP", ".NET"]
print("ตำแหน่ง -5 ใน books_lst คือ ", books_lst[-5]) # start ที่ index ตำแหน่ง -5
print("ตำแหน่ง 1-6 ใน books_lst คือ ", books_lst[:6]) # stop ที่ index ตำแหน่งที่ 6 ใน
print("ตำแหน่ง 1-4 ใน books_lst คือ", books_lst[1:4]) # start ที่ index ตำแหน่งที่ 1 stop ที่ index ตำแหน่งที่ 4 ใน
print("แสดงข้อมูลจากตำแหน่งที่ 1-6 โดยข้ามทีละ 2 = ", books_lst[1:6:2]) # start ที่ index ตำแหน่ง 1 stop ที่ index ตำแหน่งที่ 6 และกระโดดข้ามทีล่ะ 2 ตำแหน่ง -1
print("แสดงข้อมูลทั้งหมดใน books_lst โดยข้ามทีละ 2 = ", books_lst[::2]) # กระโดดข้ามทีล่ะ 2 ตำแหน่ง -1