a = [12, 18.6, 'book'] #ตัวแปร a จัดเก็บข้อมูลชนิดลิสต์
print(a)

"""
ชนิดข้อมูลแบบ Tuple เป็นข้อมูลที่ประกอบด้วยรายการต่างชนิดกันเหมือนกับรายการลิสต์ แต่ต่างกันที่ทูเพิลไม่สามารถเพิ่ม ลด และแก้ไขข้อมูลในรายการได้
"""
x = (5, 2.08, 'python', 2+4j) #กำหนดตัวแปร x เก็บข้อมูลชนิดทูเพิล
print(x)


"""
ชนิดข้อมูล Set เป็นชุดข้อมูลที่มีรายการไม่ซ้ำกันและไม่ได้จัดลกำดับ รายการข้อมูลจะอยู่ภายในเครื่องหมายวเล็บปีกกา
{} และสนับสนุนการกำเนินการทางคณิตศาสตร์ เช่น Union, Intersect, difference และ symmetric
"""
s = {1,2,2,3,3,7,7,8,8,9,32,22}
print(s) #จะได้ข้อมูลที่ไม่ซ้ำกัน และไม่ได้จัดลำดับถ้าเราไม่ได้จัดมาก่อน

s2 = {1,2,3,4,5,6,7,8,9,11}
print(s2)

"""
ดิกชั่นนารี (Dictionary) เป็นข้อมูลในลักษณะของรายการ ซึ้งในหนึ่งรายการประกอบด้วยคู่ของคีย์และค่า (key/value) โดยคีย์ในแต่ล่ะลิสต์รายการจะต้อไม่ซ้ำกัน
"""
d = {1 : 'apple', 2 : 'Banana', 3 : 'Orange'}
print(d.keys()) #เช็ค key
print(d[1], d[2], d[3])
d2 = {'stdId':25, 'stdName':'John', 'stdSubj':['Math', 'Science']}
print(d2['stdSubj'][0])

"""
อ่านค่าข้อมูล string
"""
s = "Hello"
print(s[0])
print(s[-1]) #และสามารถกำหนดเลขดัชนีเป็นลบได้ โดยนับเลขดัชนีของลิสต์รายการตัวสุดท้ายเป็น -1
print(s[-2])
print(s[-3])
print(s[-4])
print(s[-5])

"""
อ่านค่าข้อมูล list
"""
ls = [10, 2.25, 'python']
print(ls[0])

"""
อ่านค่าข้อมูล Dictionary
"""
dic = {1:'value', 'A':'Apple', 'I':123}
print(dic[1])
print(dic['A'])
print(dic['I'])

"""
เรียกดูช่วงข้อมูล VarName[start : stop]
index start - stop -1
"""
s = 'Hello'
print(s[1:3]) #แสดงข้อมูลในตัวแปร s ระหว่างงอินเด็กซ์ 1 จนถึง 3 stop -1
print(s[2:]) #แสดงข้อมูลในตัวแปร s ที่อินเด็กซ์ 2 ไปจนจบ
print(s[:2]) #แสดงข้อมูลที่อินเด็กซ์ 2 ไปจนจบ
"""
list 
index start - stop -1
"""
ls = [10, 2.25, 'python'] #ประกาศตัวแปร ls เก็บชนิดข้อมูลเป็น list
print(ls[0:2]) #แสดงข้อมูลในตัวแปร ls เริ่มจากอินเด็กซ์ 0 จนถึง 1
print(ls[1:3]) #แสดงข้อมูล ls เริ่มจากอินเด็กซ์ 1 จนถึง 2
add = ls + ['ggwp']
add[3] = 45
print(add)

"""
tuple 
index start - stop -1
"""
tp = (5, 2.08, 'python', (2+4j))
print(tp[2:4])