# for เป็นการวนลูปที่สามารถกำหนดจำนวนครั้งที่แน่นอน โดยมีการกำหนดจุดเริ่มต้น และนับจำนวนครั้งจนถึงจุดสิ้นสุดของการวนลูป
# ในไฟธอนใช้ตัวดำเนินการ in ร่วมกับการทำซ้ำเพื่อเข้าถึงรายการในข้อมูลชนิดแบบเรียงลำดับรายการ (Sequence) ได้แก่
# String, List และ Tuple หรือสามารถระบุช่วงของค่าในรายการที่จะใช้ได้โดยระบุช่วงที่ต้องการด้วย ฟังก์ชั่น range()
# รูปแบบ loop for |
# for iterate_var in sequence:
#     statement
# iterte_var: ตัวแปรที่เก็บค่าจากรายการเมื่อวนลูปในแต่ล่ะรอบ
# sequence : ข้อมูลชนิดเรียงลำดับรายการ (Sequence)
# ได้แก่ String, List และ Tuple หรือการกำหนดช่วงด้วยฟังก์ชั่น range()
# block statement: กลุ่มคำสั่งที่ต้องการให้ทำซ้ำในแต่ล่ะรอบ โดยจะอยู่ในย่อหน้าภายใต้คำสั่ง for

s = 'simplify' # กำหนดตัวแปร s เก็บข้อมูลสตริง simplify จะใช้ในการหาลำดับของ ตัวแปร s
n = 1 # กำหนดตัวแปร n มีค่า 1 ใช้บอกลำดับรายการตัวอักขระ
for i in s :
    print('List item',n,'=', i) # แสดงข้อมูลในแต่ล่ะลิสต์รายการที่เก็บจากตัวแปร s ในตัวแปร i
    n += 1 # เพิ่มจำนวนลำดับของรายการอักขระที่อยู่ในตัวแปร s (ตัวแปร n วนลูปตามจำนวนลำดับในตัวแปร s)