# การใช้ฟังก์ชั่น range() ในคำสั่ง for
# range() เป็นฟังก์ชั่นที่ใช้สร้างลำดับตัวเลขตามที่ขอบเขตที่กำหนด ซึ้งสามารถนำลำดับตัวเลขมาใช้กับรายการ
# ของข้อมูลประเภทเรียงลำดับรายการ (Sequence)
# range (x) สร้างลำดับตัวเลข เพิ่มขึ้นทีล่ะ 1 เริ่มจาก 0จนค่าสุดท้ายไม่ถึงต่า x
# range (x, y) สร้างลำดับตัวเลข เพิ่มขึ้นทีล่ะ 1 เริ่มจาก x จนค่าสุดท้ายไม่ถึง y
# range (x, y, z) สร้างลำดับตัวเลข เพิ่มขึ้นหรือลดลงทีล่ะ z เริ่มจาก x จนค่าสุดท้ายไม่ถึงค่า y

for i in range(0, 10, 2):
    print(i)

for i in range(1,10):
    if i % 2 == 0:
        print(i,' is Even number')
    else:
        print(i,' is Odd number')