# การเขียนตัวเลขหลักพันนั้นเราไม่สามรถใช้เครื่องหมาย , คั่นหลักพันได้ แต่ในภาษาไพธอน อณุญาติให้เราใส่เครื่องหมาย Underscore _ แทรกลงไประหว่างตัวเลขเเพื่อให้อ่านง่ายขึ้น
# สามารถเขียนแทรกไว้ระหว่างตัวเลขได้ทั้งส่วนจำนวนเต็มและทศนิยม
# ไม่จำเป็นต้องใช้คั่นหลักพัน แต่คั่นระหว่างตัวเลขที่หลักไดๆ ก็ได้
# ห้ามเขียน _ ต่อเนืองกันตั้งแต่ 2 อันขึ้นไป
# ห้ามใช้เป็นตัวขึ้นต้นและตัวสุดท้าย
# สามารถนำตัวเลขนั้นไปคำนวณได้ตามปกติ
# ถ้าเราใช้ฟังก์ชั่น print() จะไม่มีเครื่องหมาย _ ติดอยู่
a = 1_234_567 # ok
print(a) #1234567
print(a + 1) #12345678 ( a = 1234567 + 1 ) + เลขตำแหน่งสุดท้ายขึ้น 1

b = 1_2_3_4 # ok ( ไม่จำเป็นต้องใช้คั่นหลักพันก็ได้ )

# c = 1__2__3 #Error ( ห้ามเขียน _ ต่อเนืองกันตั้งแต่ 2 อันขึ้นไป )
# d = _1_2_3 # Error ( ห้ามใช้ _ เป็นตัวขึ้นต้น )
# e = 1_2_3_ # Error ( ห้ามใช้ _ เป็นตัวสุดท้าย )

f = 123_456.78_9_0 # ok
print(f)

# g = 12._3_4_5 # Error (เพราะส่วนทศนิยมขึ้นต้นด้วย _)
# h = 123.456_ # Error (เพราะส่วนทศนิยมลงท้ายด้วย _)